In [1]:
import pandas as pd
import numpy as np

# Find top 15 amout postion and get the average salary

In [3]:
data = pd.read_csv('salary.csv')

In [4]:
data

     Gender                   Position   Employment status  Total_Salary
0      Male               XR Developer  Full-time employee       27000.0
1    Female                Testmanager  Full-time employee      120000.0
2      Male             Testautomation  Full-time employee       60000.0
3      Male               Test manager  Full-time employee       48400.0
4      Male  Technical project manager  Full-time employee       71000.0
..      ...                        ...                 ...           ...
761    Male          Backend Developer  Full-time employee       50000.0
762    Male          Backend Developer  Full-time employee       75000.0
763    Male          Backend Developer  Full-time employee      130000.0
764    Male          Backend Developer  Full-time employee      170000.0
765    Male          Backend Developer  Full-time employee      142000.0

[766 rows x 4 columns]

In [15]:
pos_sa = data.groupby('Position').mean()

In [16]:
pos = data.groupby("Position").size()

In [17]:
pos = pos.to_frame()

In [18]:
pos = pos.rename(columns = {0:'Count'})

In [19]:
pos.sort_values(by = ["Count"],ascending=False, inplace = True)

In [20]:
pos_cnt_sa = pos.join(pos_sa)

In [21]:
Top15 = pos_cnt_sa.round(0)[:15]

In [22]:
in_list= list(range(1,16))

In [23]:
Top15 = Top15.reset_index()

In [28]:
top15pos = Top15['Position']

In [148]:
Top15.to_csv('Top15position.csv',index=False)

# Gender pie chart

In [5]:
gender = data.groupby("Gender").mean().round(0).reset_index()

In [11]:
ceil(gender['Total_Salary'])

NameError: name 'ceil' is not defined

In [241]:
gender.to_csv('gender.csv',index=False)

# Work experience

In [2]:
data1 = pd.read_csv('./IT Salary Survey EU  2020.csv')

In [209]:
data2 = data1[['Total years of experience','Yearly brutto salary (without bonus and stocks) in EUR']]

In [210]:
data2 = data2.rename(columns = {'Total years of experience':'Experience','Yearly brutto salary (without bonus and stocks) in EUR':'Salary'})

In [211]:
data2 = data2.dropna(axis=0, how='any')

In [232]:
data3=data2[data2['Experience'].apply(lambda x: str(x).isnumeric())]

In [233]:
bins=[0,5,10,15,20,25,50]
labels = ["0-5","6-10","11-15","16-20","21-25","26+"]

In [234]:
data3 = data3.astype(int)

In [237]:
data3.dtypes

Experience       int64
Salary           int64
Seniority     category
dtype: object

In [236]:
data3["Seniority"] = pd.cut(x=data3["Experience"],bins=bins,labels=labels)

In [239]:
data_exp = data3.groupby('Seniority')['Salary'].mean().round(0).to_frame().reset_index()

In [240]:
data_exp

  Seniority   Salary
0       0-5  59434.0
1      6-10  72782.0
2     11-15  80428.0
3     16-20  88796.0
4     21-25  78556.0
5       26+  74664.0

# Industry

In [3]:
data1

,Timestamp,Age,Gender,City,Position,Total years of experience,Years of experience in Germany,Seniority level,Your main technology / programming language,Other technologies/programming languages you use often,...,Annual bonus+stocks one year ago. Only answer if staying in same country,Number of vacation days,Employment status,Сontract duration,Main language at work,Company size,Company type,Have you lost your job due to the coronavirus outbreak?,"Have you been forced to have a shorter working week (Kurzarbeit)? If yes, how many hours per week","Have you received additional monetary support from your employer due to Work From Home? If yes, how much in 2020 in EUR"
0,25/11/2020 13:26:21,24.0,Male,Munich,Data Scientist,1,1,Junior,C++,"Python, C/C++, Swift, Java / Scala, R, SQL, Go...",...,NaN,NaN,Full-time employee,NaN,English,101-1000,Startup,No,10.0,NaN
1,25/11/2020 15:53:21,40.0,Male,Cupertino,Software Engineer,20,0,Lead,Swift,NaN,...,300000,45,Full-time employee,Unlimited contract,English,1000+,Product,No,NaN,NaN
2,26/11/2020 22:41:33,20.0,Male,Berlin,Mobile Developer,5,2,Lead,C#,.NET,...,NaN,27,Full-time employee,Unlimited contract,English,1000+,Product,Yes,0.0,0
3,24/11/2020 21:36:24,32.0,Male,Berlin,CTO,10,4,CTO,JAVA,"Python, C/C++",...,NaN,28,Full-time employee,Unlimited contract,English,101-1000,Product,Yes,NaN,NaN
4,25/11/2020 13:16:43,38.0,Male,Berlin,Freelance AI lead / advisor,20,7,Head,C,"Python, C/C++, Docker",...,80000,0,Self-employed (freelancer),0,English,up to 10,Consulting / Agency,Yes,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1245,08/12/2020 22:10:37,24.0,Male,Berlin,ML Engineer,0.8,0.2,Junior,Python,Python,...,NaN,24,Werkstudent,Temporary contract,English,11-50,Consulting / Agency,No,NaN,NaN
1246,26/11/2020 14:37:05,27.0,Male,Bucharest,QA Engineer,1,0,Junior,Javascript,Javascript / Typescript,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1247,24/11/2020 18:32:14,24.0,Male,Aachen,HiWi,3,2,Junior,Python,"Python, C/C++",...,NaN,14,Part-time employee,Temporary contract,English,11-50,University,No,NaN,NaN
1248,28/11/2020 05:36:11,27.0,Male,Hamburg,Backend Developer,3,_,Middle,.net,"Javascript / Typescript, .NET, SQL, Docker",...,NaN,NaN,Part-time employee,Temporary contract,English,11-50,Consulting / Agency,No,NaN,NaN
1249,30/11/2020 18:25:04,22.0,Male,Istanbul,Backend Developer,3,0,Middle,PHP,"Python, Javascript / Typescript, SQL, AWS, Docker",...,NaN,0,Self-employed (freelancer),Unlimited contract,English,up to 10,Startup,Yes,0.0,No

In [6]:
pos_sal = data1[['Position ','Yearly brutto salary (without bonus and stocks) in EUR']]

In [11]:
pos_sal  = pos_sal .rename(columns = {'Position ':'Position','Yearly brutto salary (without bonus and stocks) in EUR':'Salary'}).dropna(axis=0, how='any')

In [64]:
pos_sal

                         Position    Salary
0                  Data Scientist  300000.0
1               Software Engineer  250000.0
2                Mobile Developer  240000.0
3                             CTO  200000.0
4     Freelance AI lead / advisor  200000.0
...                           ...       ...
1245                  ML Engineer   11500.0
1246                  QA Engineer   11000.0
1247                         HiWi   10164.0
1248            Backend Developer   10001.0
1249            Backend Developer   10001.0

[1245 rows x 2 columns]

In [33]:
top15pos =top15pos.tolist()

In [34]:
top15pos

['Software Engineer',
 'Backend Developer',
 'Data Scientist',
 'Frontend Developer',
 'DevOps',
 'QA Engineer',
 'Mobile Developer',
 'ML Engineer',
 'Data Engineer',
 'Product Manager',
 'Data Analyst',
 'Engineering Manager',
 'Designer (UI/UX)',
 'Tech Lead',
 'Software Architect']

In [65]:
pos_sal_15 = pos_sal.loc[pos_sal['Position'].isin(top15pos)]

In [74]:
pos_sal_15.describe()

              Salary
count    1084.000000
mean    70622.046125
std     23287.158823
min     10001.000000
25%     59766.000000
50%     70000.000000
75%     80000.000000
max    300000.000000

In [80]:
bins_sal=[10000,50000,60000,70000,80000,100000,400000]
labels_sal = ["10k-50k","50k-60k","60k-70k","70k-80k","80k-100k","100k+"]

In [81]:
pos_sal_15["Salary_period"] = pd.cut(x=pos_sal_15["Salary"],bins=bins_sal,labels=labels_sal)

/var/folders/sh/j4m64ylj7yq453j3dyjbbybc0000gn/T/ipykernel_28511/1711292258.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pos_sal_15["Salary_period"] = pd.cut(x=pos_sal_15["Salary"],bins=bins_sal,labels=labels_sal)

In [82]:
pos_sal_15.sort_values(by = ['Salary'],inplace=True)

In [83]:
df_sp = pos_sal_15.reset_index(drop=True)

In [84]:
df_sp.groupby('Salary_period').size()

Salary_period
10k-50k     138
50k-60k     209
60k-70k     266
70k-80k     239
80k-100k    174
100k+        58
dtype: int64

In [108]:
dz = df_sp.groupby(['Salary_period','Position'], as_index=False).count()

In [109]:
dz

   Salary_period            Position  Salary
0        10k-50k   Backend Developer      22
1        10k-50k        Data Analyst       2
2        10k-50k       Data Engineer       3
3        10k-50k      Data Scientist      21
4        10k-50k    Designer (UI/UX)       6
..           ...                 ...     ...
85         100k+     Product Manager       4
86         100k+         QA Engineer       1
87         100k+  Software Architect       2
88         100k+   Software Engineer      22
89         100k+           Tech Lead       0

[90 rows x 3 columns]

In [110]:
da = pd.pivot(dz, index='Salary_period', columns='Position')

In [120]:
da = da['Salary']

In [134]:
da = da.reset_index()

In [143]:
da.to_csv('Salary_line.csv',index=False)